<a href="https://colab.research.google.com/github/erikamarchi/data-visualization-explorando-com-seaborn/blob/main/EDA_Gorjetas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#dataset

In [3]:
import pandas as pd

In [11]:
dados = pd.read_csv('tips.csv')

In [6]:
dados.head()

   total_bill   tip dessert  day    time  size
0       16.99  1.01      No  Sun  Dinner     2
1       10.34  1.66      No  Sun  Dinner     3
2       21.01  3.50      No  Sun  Dinner     3
3       23.68  3.31      No  Sun  Dinner     2
4       24.59  3.61      No  Sun  Dinner     4

In [13]:
gorjetas = dados.rename(columns={'total_bill':'valor_da_conta',
              'tip':'gorjeta',
              'dessert':'sobremesa',
              'day':'dia_da_semana',
              'time':'hora_do_dia',
              'size':'total_de_pessoas'})
gorjetas.head()

   valor_da_conta  gorjeta  ... hora_do_dia total_de_pessoas
0           16.99     1.01  ...      Dinner                2
1           10.34     1.66  ...      Dinner                3
2           21.01     3.50  ...      Dinner                3
3           23.68     3.31  ...      Dinner                2
4           24.59     3.61  ...      Dinner                4

[5 rows x 6 columns]

In [14]:
gorjetas.sobremesa.unique()

array(['No', 'Yes'], dtype=object)

In [15]:
gorjetas.sobremesa.replace({'Yes':'Sim',
                            'No':'Não'}, inplace=True)
gorjetas.head()

   valor_da_conta  gorjeta  ... hora_do_dia total_de_pessoas
0           16.99     1.01  ...      Dinner                2
1           10.34     1.66  ...      Dinner                3
2           21.01     3.50  ...      Dinner                3
3           23.68     3.31  ...      Dinner                2
4           24.59     3.61  ...      Dinner                4

[5 rows x 6 columns]

In [17]:
gorjetas.dia_da_semana.unique()

array(['Sun', 'Sat', 'Thur', 'Fri'], dtype=object)

In [19]:
gorjetas.dia_da_semana.replace({'Sun':'Domingo',
                                'Sat':'Sábado',
                                'Thur':'Quinta',
                                'Fri':'Sexta'}, inplace=True)
gorjetas.dia_da_semana.unique()

array(['Domingo', 'Sábado', 'Quinta', 'Sexta'], dtype=object)

In [20]:
gorjetas.hora_do_dia.unique()

array(['Dinner', 'Lunch'], dtype=object)

In [21]:
gorjetas.hora_do_dia.replace({'Dinner':'Jantar',
                                'Lunch':'Almoço'}, inplace=True)
gorjetas.hora_do_dia.unique()

array(['Jantar', 'Almoço'], dtype=object)

In [22]:
gorjetas.head()

   valor_da_conta  gorjeta  ... hora_do_dia total_de_pessoas
0           16.99     1.01  ...      Jantar                2
1           10.34     1.66  ...      Jantar                3
2           21.01     3.50  ...      Jantar                3
3           23.68     3.31  ...      Jantar                2
4           24.59     3.61  ...      Jantar                4

[5 rows x 6 columns]